unload/cf/DataProcessors/кб99_ОбработкаНовыхПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>кб99_ОбработкаНовыхПартий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

unload/cf/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриобретениеТоваровУслуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

unload/cf/Catalogs/ВСД_Партия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВСД_Партия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсдДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПродукции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция_Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vetDocument</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенаИзПодбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьНаличиеДокументаПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛабораторныеИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерАктаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЛаборатории</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРезультата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодИсследования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭкспертизы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИсследования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

unload/cf/DataProcessors/кб99_ОбработкаНовыхПартий/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ВыбранныеПартии;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Статус = 1;
	
	мсНовыхПартий = Новый Массив;
	Если Параметры.Свойство("СписокНовыхПартий", мсНовыхПартий) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация, Площадка");
		НовыеПартии.ЗагрузитьЗначения(мсНовыхПартий);
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Площадка.ТолькоПросмотр = Истина;
		
		СписокПартий.ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВСД_Партия.Ссылка КАК Партия,
		|	ВСД_Партия.Производитель_Площадка КАК Производитель,
		|	ВСД_Партия.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВСД_Партия.ВсдДата КАК ДатаВСД,
		|	ВСД_Партия.ДатаИзготовления1 КАК ДатаИзготовления,
		|	ВСД_Партия.ДатаСрокГодности1 КАК ДатаСрокГодности,
		|	ВСД_Партия.ИсключенаИзПодбора КАК ИсключенаИзПодбора,
		|	ВСД_Партия.Количество КАК Количество,
		|	ВСД_Партия.НомерЗаписи КАК НомерЗаписи,
		|	ВСД_Партия.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВСД_Партия.Ссылка В(&ВыбранныеПартии) КАК Пометка,
		|	ВСД_Партия.ДокументПрихода КАК ДокументПрихода
		|ИЗ
		|	Справочник.ВСД_Партия КАК ВСД_Партия
		|ГДЕ
		|	ВСД_Партия.Ссылка В(&НовыеПартии)
		|	И НЕ ВСД_Партия.ПометкаУдаления";
		СписокПартий.Параметры.УстановитьЗначениеПараметра("НовыеПартии", НовыеПартии);
		
	Иначе
		
		Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
		
		ХозСубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
		Площадка = ПараметрыОрганизации.Отправитель_Площадка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыбранныеПартии = Новый Массив;
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	УстановитьОтборПартий();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПартийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.СписокПартийПометка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Пометка Тогда
				СнятьПометку(ТекущиеДанные.Партия);
			Иначе
				ПоставитьПометку(ТекущиеДанные.Партия);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	Элементы.СписокПартий.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Партия)
	
	Индекс = ВыбранныеПартии.Найти(Партия);
	Если Индекс >= 0 Тогда
		ВыбранныеПартии.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(Партия)
	
	Индекс = ВыбранныеПартии.Найти(Партия);
	Если Индекс = Неопределено Тогда
		ВыбранныеПартии.Добавить(Партия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("ХозСубъект", ХозСубъект);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, Отбор", Истина, Истина, ЗначениеОтбора);
	ОткрытьФорму("Справочник.ВСД_Площадка.ФормаВыбора", ПараметрыПодбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПартий()
	
	ОтборДинамическогоСписка = СписокПартий.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ОтборДинамическогоСписка.Элементы.Очистить();
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партия.Получатель_ХозСубъект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ХозСубъект;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ХозСубъект);
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партия.Получатель_Площадка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Площадка;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(Площадка);
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партия.Продукция_Элемент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Продукция;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(Продукция);
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтранаПроисхождения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СтранаПроисхождения;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(СтранаПроисхождения);
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсключенаИзПодбора");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Статус = 2;
	ЭлементОтбора.Использование = Статус <> 1;
	
	ЭлементОтбора = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументПрихода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование = БезДокументаПоступление;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
	
	ХозСубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
	Площадка = ПараметрыОрганизации.Отправитель_Площадка;
	УстановитьОтборПартий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	УстановитьОтборПартий();
КонецПроцедуры

&НаКлиенте
Процедура СтранаПроисхожденияПриИзменении(Элемент)
	УстановитьОтборПартий();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеОграниченияНаСервере(Исключить, ВыбранныеПартии)
	
	Для Каждого Партия Из ВыбранныеПартии Цикл
		
		обПартия = Партия.ПолучитьОбъект();
		обПартия.ИсключенаИзПодбора = Исключить;
		обПартия.Записать();
		
		ЗаписьЖурналаРегистрации("Изменение значения реквизита ИсключенаИзПодбора",
		                          УровеньЖурналаРегистрации.Примечание,
		                          Метаданные.Справочники.ВСД_Партия,
		                          Партия,
		                          "Установлено значение: " + ?(Исключить, "Исключить", "Снять ограничение")
		                          );
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзПодбора(Команда)
	
	Состояние("Выполняетя обработка",, "Подождите...", БиблиотекаКартинок.kb99_clock_24x24);
	УстановитьЗначениеОграниченияНаСервере(Истина, ВыбранныеПартии);
	ВыбранныеПартии.Очистить();
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОграничениеНаПодбор(Команда)
	
	Состояние("Выполняетя обработка",, "Подождите...", БиблиотекаКартинок.kb99_clock_24x24);
	УстановитьЗначениеОграниченияНаСервере(Ложь, ВыбранныеПартии);
	ВыбранныеПартии.Очистить();
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьОтборПартий();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	УстановитьОтборПартий();
КонецПроцедуры

&НаКлиенте
Процедура БезДокументаПоступлениеПриИзменении(Элемент)
	УстановитьОтборПартий();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ВыбранныеПартии = ПолучитьВсеПартииИзСписка();
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	Элементы.СписокПартий.Обновить();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьВсеПартииИзСписка()
	
	Запрос = Новый Запрос();
	Запрос.Текст = СписокПартий.ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбранныеПартии", Новый Массив);
	Запрос.УстановитьПараметр("НовыеПартии", НовыеПартии);
	
	Если ЗначениеЗаполнено(Площадка) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ВСД_Партия.Получатель_Площадка = &Получатель_Площадка";
		Запрос.УстановитьПараметр("Получатель_Площадка", Площадка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ВСД_Партия.СтранаПроисхождения = &СтранаПроисхождения";
		Запрос.УстановитьПараметр("СтранаПроисхождения", СтранаПроисхождения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Продукция) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ВСД_Партия.Продукция_Элемент = &Продукция_Элемент";
		Запрос.УстановитьПараметр("Продукция_Элемент", Продукция);
	КонецЕсли;
	
	Если Статус <> 1 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ВСД_Партия.ИсключенаИзПодбора = " + ?(Статус = 2, "ИСТИНА", "ЛОЖЬ");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Рез = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Рез.Добавить(Выборка.Партия);
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	ВыбранныеПартии = Новый Массив;
	СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
	Элементы.СписокПартий.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДокументПоступление(Команда)
	
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("Проведен", Истина);
	ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	ЗначениеОтбора.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.ФормаВыбора",
	                                              ПараметрыФормы,
	                                              ЭтаФорма,,,,
	                                              ОбработкаВыбора,
	                                              РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
												  
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(РезультатВыбора, ДопПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние("Выполняетя обработка",, "Подождите...", БиблиотекаКартинок.kb99_clock_24x24);
	ЕстьОшибки = Ложь;
	ЗаписатьДокументПриходаВСправочникПартии(ВыбранныеПартии, РезультатВыбора, ЕстьОшибки);
	Если Не ЕстьОшибки Тогда
		ВыбранныеПартии.Очистить();
		СписокПартий.Параметры.УстановитьЗначениеПараметра("ВыбранныеПартии", ВыбранныеПартии);
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДокументПриходаВСправочникПартии(ВыбранныеПартии, РезультатВыбора, ЕстьОшибкаОтсутсвуетВДокументе)
	
	НоменклатураДокумента = РезультатВыбора.Товары.ВыгрузитьКолонку("Номенклатура");
	НоменклатураДокумента = кб99_ВСД_Общий.СвернутьМассив(НоменклатураДокумента);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент
		|ПОМЕСТИТЬ втСоответствия
		|ИЗ
		|	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
		|ГДЕ
		|	НЕ ВСД_Соответсвия.ПометкаУдаления
		|	И ВСД_Соответсвия.Владелец В(&СписокНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВСД_Соответсвия.ПродукцияЭлемент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПродукцияЭлемент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВСД_Партия.Продукция_Элемент.Представление КАК ПродукцияЭлемент,
		|	втСоответствия.ПродукцияЭлемент ЕСТЬ NULL КАК Отказ
		|ИЗ
		|	Справочник.ВСД_Партия КАК ВСД_Партия
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствия КАК втСоответствия
		|		ПО ВСД_Партия.Продукция_Элемент = втСоответствия.ПродукцияЭлемент
		|ГДЕ
		|	ВСД_Партия.Ссылка В(&ВыбранныеПартии)";
	
	Запрос.УстановитьПараметр("ВыбранныеПартии", ВыбранныеПартии);
	Запрос.УстановитьПараметр("СписокНоменклатуры", НоменклатураДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Отказ Тогда
			кб99_ВСД.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"[%1] отсутсвует в документе %2", Выборка.ПродукцияЭлемент, РезультатВыбора), 
				РезультатВыбора,,, ЕстьОшибкаОтсутсвуетВДокументе);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибкаОтсутсвуетВДокументе Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Партия Из ВыбранныеПартии Цикл
		
		обПартия = Партия.ПолучитьОбъект();
		обПартия.ДокументПрихода = РезультатВыбора;
		обПартия.Записать();
		
		ЗаписьЖурналаРегистрации("Изменение значения реквизита ДокументПрихода",
		                          УровеньЖурналаРегистрации.Примечание,
		                          Метаданные.Справочники.ВСД_Партия,
		                          Партия,
		                          "Установлено значение: " + Строка(РезультатВыбора)
		                          );
	КонецЦикла;

КонецПроцедуры
